# darktable development dependencies for macOS
# Install with: brew bundle

# Build tools
brew "cmake"
brew "intltool"
brew "pkg-config"
brew "llvm"  # optional, for OpenCL test compilation

# Core libraries (GTK3 pulls in most of these)
brew "gtk+3"
brew "glib"
brew "json-glib"
brew "libxml2"
brew "pugixml"
brew "libpng"
brew "jpeg-turbo"
brew "libtiff"
brew "little-cms2"

# Required libraries
brew "lensfun"
brew "sqlite"
brew "exiv2"
brew "gettext"
brew "icu4c"

# Optional libraries
brew "openexr"
brew "libheif"
brew "libavif"
brew "jpeg-xl"
brew "webp"
brew "openjpeg"
brew "graphicsmagick"
brew "libraw"
brew "lua"
brew "portmidi"
brew "sdl2"
brew "gmic"
brew "freexl"
brew "libgeotiff"
brew "libspatialite"
brew "libgphoto2"
brew "libomp"
brew "libarchive"

# Optional: map mode
brew "osm-gps-map"

# Optional: color management (colord not available on macOS Homebrew)

# Optional: secret storage
brew "libsecret"
